WcfHarness/WcfHarness/RequestXmls/UpdateRole.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <UpdateRole xmlns="http://www.tavisca.com/Vexiere/IRole/2013/01">
      <updateRoleRequest i:type="a:UpdateOrganizationRoleRQ" xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:OrganizationIdentifier i:type="a:IdBasedOrganizationIdentifier">
          <a:Id>1</a:Id>
        </a:OrganizationIdentifier>
        <a:Role>
          <a:CreatedOn>0001-01-01T00:00:00</a:CreatedOn>
          <a:Id>0</a:Id>
          <a:ModifiedOn>0001-01-01T00:00:00</a:ModifiedOn>
          <a:Status>Active</a:Status>
          <a:Description>updated role</a:Description>
          <a:IsDefault>false</a:IsDefault>
          <a:IsDeleted>false</a:IsDeleted>
          <a:Name>sample roleName</a:Name>
        </a:Role>
      </updateRoleRequest>
    </UpdateRole>
  </s:Body>
</s:Envelope>